<?php

namespace Database\Seeders;

use App\Models\Vaccine;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class VaccineSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        /**
         * @url https://www.unicef.org/northmacedonia/mk/media/9306/file/MKD-vaccines-immunization-calendar-2022.pdf
         */
        $vaccines = [

            [
                'age' => '24',
                'age_title'=> '24 часа од раѓање',
                'name' => 'Хепатитис Б',
                'comment' => 'Вакцинирање',
                'description' => 'Во првите 24 часа од раѓање детето се вакцинира со Хепатитис Б вакцина',
            ],

            [
                'age' => '8761',
                'age_title'=> 'до 12 месеци',
                'name' => 'БЦГ',
                'comment' => 'Вакцинирање',
                'description' => 'До крајот на првата година детето се вакцинира со БЦГ вакцина без претходно туберкулинско тестирање',
            ],
            [
                'age' => '1461',
                'age_title'=> '2 месеци',
                'name' => 'ДиТеПер ацелуларна, ХиБ, Хеп Б и ИПВ',
                'comment' => 'Вакцинирање / шестовалентна или поединечна вакцина',
                'description' => 'Со полни 2 месеци детето се вакцинира со шестовалентна вакцина која содржи (ДиТеПер ацелуларна, ХиБ, Хеп Б и ИПВ) или со поединечни вакцини',
            ],
            [
                'age' => '2556',
                'age_title'=> '3,5 месеци',
                'name' => 'Ди Те Пер ,ХиБ,Полио',
                'comment' => 'Вакцинирање / шестовалентна или поединечна вакцина',
                'description' => 'Со полни 3,5 месеци детето се вакцинира со петтовалентна вакцина која содржи (ДиТеПер ацелуларна, ХиБ и ИПВ) или со поединечни вакцини',
            ],
            [
                'age' => '4381',
                'age_title'=> '6 месеци',
                'name' => 'Де Те Пер , ХиБ ,Хепатитис Б, Полио',
                'comment' => 'Вакцинирање / шестовалентна или поединечна вакцина',
                'description' => 'Со полни 6 месеци детето се вакцинира со шестовалентна вакцина која содржи (ДиТеПер ацелуларна, ХиБ, Хеп Б и ИПБ) или со поединечни вакцини',
            ],
            [
                'age' => '8761',
                'age_title'=> '12 месеци',
                'name' => 'МРП',
                'comment' => 'Вакцинирање',
                'description' => 'Со полни 12 месеци детето се вакцинира со МРП вакцина.',
            ],
            [
                'age' => '13141',
                'age_title'=> '18 месеци',
                'name' => 'Ди Те Пер,ХИБ,Полио',
                'comment' => 'I Ревакцинирање /петтовалентна или поединечна вакцина',
                'description' => 'Со полни 18 месеци детето се вакцинира со петтовалентна вакцина која содржи (ДиТеПер ацелуларна, ХиБ и ИПВ) или со поединечни вакцини како I ревакцина',
            ],
            [
                'age' => '35064',
                'age_title'=> '4 години',
                'name' => 'Ди Те Пер',
                'comment' => 'II Ревакцинирање ',
                'description' => ' Со полни 4 години детето се вакцинира со ДиТеПер како II ревакцина',
            ],
            [
                'age' => '35064',
                'age_title'=> '4 години',
                'name' => 'Ди Те Пер',
                'comment' => 'II Ревакцинирање ',
                'description' => ' Со полни 4 години детето се вакцинира со ДиТеПер како II ревакцина',
            ],
            [
                'age' => '52596',
                'age_title'=> '6 години',
                'name' => 'МРП',
                'comment' => 'Ревакцинирање',
                'description' => 'Со полни 6 години детето се вакцинира со МРП ревакцина.',
            ],
            [
                'age' => '61362',
                'age_title'=> '7 години',
                'name' => 'ДиТе-адултна, Полио',
                'comment' => 'III Ревакцинирање ',
                'description' => ' Со полни 7 години детето се вакцинира со Ди-Те адултна вакцина како III ревакцина и со ОПВ како II ревакцина ',
            ],
            [
                'age' => '105192',
                'age_title'=> '12 години',
                'name' => 'ХПВ',
                'comment' => 'Вакцинирање',
                'description' => 'Со полни 12 години се вакцинираат само девојчињата со ХПВ вакцина',
            ],
            [
                'age' => '122724',
                'age_title'=> '14 години',
                'name' => 'ДиТе-адултна,ПОЛИО',
                'comment' => 'IV Ревакцинирање ',
                'description' => 'Со полни 14 години детето се вакцинира со Ди-Те адултна вакцина како IV ревакцина и со ОПВ како III ревакцина',
            ],
            [
                'age' => '157788',
                'age_title'=> '18 години',
                'name' => 'ТТ',
                'comment' => 'V Ревакцинирање ',
                'description' => 'Со полни 18 години детето се вакцинира со Тетанус V ревакцинa ',
            ],

        ];
        foreach ($vaccines as $vaccine) {

            Vaccine::query()->create([
                'age' => $vaccine['age'],
                'age_title' => $vaccine['age_title'],
                'name' => $vaccine['name'],
                'comment' => $vaccine['comment'],
                'description' => $vaccine['description'],
            ]);
        }
    }
}
